vez = [
	{
		"profile": "1",
		"pk": "0",
		"wather": "пасмурно",
		"date": "08/12/14",
		"setup": "симметричная",
		"points" : [
			{"ab2": 3, "mn2": 1, "k": 12.56, "ma": 63, "omm": 264},
			{"ab2": 5, "mn2": 1, "k": 37.7, "ma": 24.8, "omm": 311},
			{"ab2": 9, "mn2": 1, "k": 125.6, "ma": 10, "omm": 419},
			{"ab2": 15, "mn2": 1, "k": 352, "ma": 5, "omm": 587},
			{"ab2": 25, "mn2": 1, "k": 980, "ma": 23, "omm": 719},
			{"ab2": 40, "mn2": 1, "k": 2510, "ma": 1.05, "omm": 879},
			{"ab2": 65, "mn2": 1, "k": 6632, "ma": 0.49, "omm": 1083},
			{"ab2": 100, "mn2": 1, "k": 15700, "ma": 0.22, "omm": 1151},
			{"ab2": 150, "mn2": 1, "k": 35320, "ma": 0.31, "omm": 1095}
		]
	}, {
		"profile": "1",
		"pk": "1",
		"wather": "пасмурно",
		"date": "08/12/14",
		"setup": "симметричная",
		"points" : [
			{"ab2": 3, "mn2": 1, "k": 12.56, "ma": 87, "omm": 365},
			{"ab2": 5, "mn2": 1, "k": 37.7, "ma": 38, "omm": 477},
			{"ab2": 9, "mn2": 1, "k": 125.6, "ma": 16, "omm": 670},
			{"ab2": 15, "mn2": 1, "k": 352, "ma": 74, "omm": 868},
			{"ab2": 25, "mn2": 1, "k": 980, "ma": 34, "omm": 1112},
			{"ab2": 40, "mn2": 1, "k": 2510, "ma": 16, "omm": 1339},
			{"ab2": 65, "mn2": 1, "k": 6632, "ma": 0.59, "omm": 1304},
			{"ab2": 100, "mn2": 1, "k": 15700, "ma": 0.31, "omm": 1622},
			{"ab2": 150, "mn2": 1, "k": 35320, "ma": 0.51, "omm": 1800}
		]
	}
];


style =
	stroke: "#000"
	strokeWidth: 5
	fill: "none"

paper = Snap "100%", "800"

getPath = (points) ->
	return if not points.length

path = paper
	.path "M0,0Q100,000,300,200,400,200,500,100"
	.attr style
	.attr {stroke: "#00e"}

path2 = paper
	.path "M0,0L100,000,300,200,400,200,500,100"
	.attr style
	.attr {stroke: "#e00"}


